Table of Contents
 Class CheckResPlate
Namespace
IdeaRS.OpenModel.Connection
Assembly
IdeaRS.OpenModel.dll
Check value for Plate
[Serializable]
[DataContract]
public class CheckResPlate
Inheritance
object
CheckResPlate
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 CheckStatus
Status of the Check
[DataMember]
public bool CheckStatus { get; set; }
Property Value
bool
 Items
In case of presentation of groups plates (uncoiled beams)
[DataMember]
public List<int> Items { get; set; }
Property Value
List<int>
 LoadCaseId
Id of Load Case
[DataMember]
public int LoadCaseId { get; set; }
Property Value
int
 MaxStrain
Max Strain
[DataMember]
public double MaxStrain { get; set; }
Property Value
double
 MaxStress
Max Stress
[DataMember]
public double MaxStress { get; set; }
Property Value
double
 Name
Name of Plate
[DataMember]
public string Name { get; set; }
Property Value
string
 Edit this page